// Next.js API route support: https://nextjs.org/docs/api-routes/introduction
import type { NextApiRequest, NextApiResponse } from "next";

type Data = {
  name: string;
};

export default function handler(
  req: NextApiRequest,
  res: NextApiResponse<Data>
) {
  let d: any = [
    {
      item: {
        count: 19986,
        word: "তই",
        pronunciation: "তোই",
        definition: "[দেশি] বি. আবটাবিহীন অগভীর কড়াই, ছোটো তাওয়া।",
        data: "তই /তোই/ [দেশি] বি. আবটাবিহীন অগভীর কড়াই, ছোটো তাওয়া।",
      },
      refIndex: 19747,
    },
    {
      item: {
        count: 19987,
        word: "তওফিক",
        pronunciation: "তওফিক",
        definition: "[আ.] বি. ১ ক্ষমতা; সামর্থ্য, শক্তি। ২ সম্পদ।",
        data: "তওফিক /তওফিক/ [আ.] বি. ১ ক্ষমতা; সামর্থ্য, শক্তি। ২ সম্পদ।",
      },
      refIndex: 19748,
    },
    {
      item: {
        count: 19988,
        word: "তওবা",
        pronunciation: "তওবা",
        definition:
          "[আ.] বি. ১ পুনরায় পাপ না করার সংকল্পসূচক উক্তি। ২ অন্যায়ের প্রতিবাদে ধিকার- সূচক উক্তি।",
        data: "তওবা /তওবা/[আ.] বি. ১ পুনরায় পাপ না করার সংকল্পসূচক উক্তি। ২ অন্যায়ের প্রতিবাদে ধিকার- সূচক উক্তি।         ।",
      },
      refIndex: 19749,
    },
    {
      item: {
        count: 19989,
        word: "তওয়াফ",
        pronunciation: "তওআফ",
        definition: "[আ.] বি. কাবাশরিফ পরিক্রমণ, তীর্থস্থান প্রদক্ষিণ।",
        data: "তওয়াফ /তওআফ/[আ.] বি. কাবাশরিফ পরিক্রমণ, তীর্থস্থান প্রদক্ষিণ।",
      },
      refIndex: 19750,
    },
    {
      item: {
        count: 19990,
        word: "তওরাত",
        pronunciation: "তওরাতৃ",
        definition:
          "[আ.] বি. হজরত মুসার নিকট প্রেরিত এঁশীবাণী-সংবলিত ধর্মপ্রথ।",
        data: "তওরাত /তওরাতৃ/ [আ.] বি. হজরত মুসার নিকট প্রেরিত এঁশীবাণী-সংবলিত ধর্মপ্রথ।",
      },
      refIndex: 19751,
    },
    {
      item: {
        count: 19991,
        word: "তওহিদ",
        pronunciation: "তওহিদ্‌",
        definition:
          "[আ.] বি. সমগ্র বিশ্বের স্রষ্টা এক এবং অদ্বিতীয় এমন মতবাদ; একেশ্বরবাদ।",
        data: "তওহিদ /তওহিদ্‌/ [আ.] বি. সমগ্র বিশ্বের স্রষ্টা এক এবং অদ্বিতীয় এমন মতবাদ; একেশ্বরবাদ।",
      },
      refIndex: 19752,
    },
    {
      item: {
        count: 19993,
        word: "তক",
        pronunciation: "তক্‌",
        definition: "[হি.] অব্য. অবধি, পর্যন্ত (শেষতক)।",
        data: "তক/তক্‌/ [হি.] অব্য. অবধি, পর্যন্ত (শেষতক)।",
      },
      refIndex: 19754,
    },
    {
      item: {
        count: 19994,
        word: "তকতক",
        pronunciation: "তকৃতক্‌",
        definition:
          "[বা.] অব্য, বি. পরিচ্ছন্নতার ভাব বা অবস্থা (ঘরবাড়ি তকতক করছে)।",
        data: "তকতক /তকৃতক্‌/ [বা.] অব্য, বি. পরিচ্ছন্নতার ভাব বা অবস্থা (ঘরবাড়ি তকতক করছে)।",
      },
      refIndex: 19755,
    },
    {
      item: {
        count: 19995,
        word: "তকতকে",
        pronunciation: "তকৃতোকে",
        definition: "[বা.] বিণ. পরিষ্কারপরিচ্ছন্ন, ঝকঝকে, নির্ধল ও উজ্জ্বল।",
        data: "তকতকে/তকৃতোকে/ [বা.] বিণ. পরিষ্কারপরিচ্ছন্ন, ঝকঝকে, নির্ধল ও উজ্জ্বল।",
      },
      refIndex: 19756,
    },
    {
      item: {
        count: 19996,
        word: "তকবির",
        pronunciation: "তোক্বির্‌",
        definition: "[আ.] বি. “আল্লাহু আকবর+ অর্থাৎ আল্লাহ মহান এই ধবনি।",
        data: "তকবির /তোক্বির্‌/ [আ.] বি. “আল্লাহু আকবর+ অর্থাৎ আল্লাহ মহান এই ধবনি।",
      },
      refIndex: 19757,
    },
    {
      item: {
        count: 19997,
        word: "তকমা",
        pronunciation: "তক্মা",
        definition:
          "[তুর.] বি. ১ বিশেষ কোনো পদে নিযুক্তির পরিচ্ছদ। ২ সিলমোহর। ৩ পদক।",
        data: "তকমা /তক্মা/ [তুর.] বি. ১ বিশেষ কোনো পদে নিযুক্তির পরিচ্ছদ। ২ সিলমোহর। ৩ পদক।",
      },
      refIndex: 19758,
    },
  ];
  res.status(200).json(d);
}
